src/Reports/ПечатьФормы39.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПечатьФормы39</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентПлательщик</Name>
					<Comment>Контрагент плательщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗуба</Name>
					<Comment>Номер зуба(лечение)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнойТехник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РабочееВремяСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Reports/ПечатьФормы39/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, выполняет формирование отчета по информации клиента
//
Процедура ВывестиПечатьФормы39(ТабДок, НачалоПериода, КонецПериода) Экспорт
	ТабДок.Очистить();
	Макет = Отчеты.ПечатьФормы39.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиОбороты.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПродажиОбороты.Контрагент.ДатаРожденияКлиента > ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ПродажиОбороты.ДокументПродажи.Дата, ГОД, -15), ДЕНЬ, 1)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДетиДо15Лет,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПродажиОбороты.Контрагент.ДатаРожденияКлиента > ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ПродажиОбороты.ДокументПродажи.Дата, ГОД, -18), ДЕНЬ, 1)
		|					И ПродажиОбороты.Контрагент.ДатаРожденияКлиента < ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ПродажиОбороты.ДокументПродажи.Дата, ГОД, -15), ДЕНЬ, 1)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПодросткиДо18Лет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.ДокументПродажи.Ссылка) КАК Посещения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Контрагент) КАК ВсегоПациентов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Номенклатура) КАК ПроизведеноОпераций
		|ПОМЕСТИТЬ Таб
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Секунда, ) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	Таб.Сотрудник КАК Сотрудник,
		|	Таб.ДетиДо15Лет КАК ДетиДо15Лет,
		|	Таб.ПодросткиДо18Лет КАК ПодросткиДо18Лет,
		|	Таб.Посещения КАК Посещения,
		|	Таб.ВсегоПациентов КАК ВсегоПациентов,
		|	ВЫБОР
		|		КОГДА Таб.Посещения = Таб.ВсегоПациентов
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВылеченоВ1Посещение,
		|	Таб.ДетиДо15Лет + Таб.ПодросткиДо18Лет КАК ВсегоПервичныхБольных,
		|	Таб.ПроизведеноОпераций КАК ПроизведеноОпераций,
		|	СУММА(РабочееВремяСотрудниковОбороты.ДнейОборот) КАК ДнейОборот
		|ИЗ
		|	Таб КАК Таб
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяСотрудников.Обороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				День,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						Таб.Сотрудник КАК Сотрудник
		|					ИЗ
		|						Таб КАК Таб)
		|				И Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК РабочееВремяСотрудниковОбороты
		|		ПО Таб.Сотрудник = РабочееВремяСотрудниковОбороты.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	Таб.Сотрудник,
		|	Таб.ДетиДо15Лет,
		|	Таб.ПодросткиДо18Лет,
		|	Таб.Посещения,
		|	Таб.ВсегоПациентов,
		|	Таб.ПроизведеноОпераций
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник
		|ИТОГИ
		|	СУММА(ДетиДо15Лет),
		|	СУММА(ПодросткиДо18Лет),
		|	СУММА(Посещения),
		|	СУММА(ВсегоПациентов),
		|	СУММА(ВылеченоВ1Посещение),
		|	СУММА(ВсегоПервичныхБольных),
		|	СУММА(ПроизведеноОпераций),
		|	СУММА(ДнейОборот)
		|ПО
		|	ОБЩИЕ,
		|	Сотрудник";
   	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Результат = Запрос.Выполнить();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
   	ОбластьЗаголовок.Параметры.НачалоПериода = Формат(НачалоПериода, "ДФ=""дд ММММ гггг 'г.'""");
	ОбластьЗаголовок.Параметры.КонецПериода = Формат(КонецПериода, "ДФ=""дд ММММ гггг 'г.'""");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСотрудник = Макет.ПолучитьОбласть("Врач");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Пациент");
    ОбластьОбщийИтог =  Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал =  Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	
	ВыборкаСотрудник = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Пока ВыборкаСотрудник.Следующий() Цикл
		ОбластьСотрудник.Параметры.Заполнить(ВыборкаСотрудник);
		ТабДок.Вывести(ОбластьСотрудник, ВыборкаСотрудник.Уровень());
 	КонецЦикла;
	ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
	ТабДок.Вывести(ОбластьПодвал);
 КонецПроцедуры
 
 #КонецОбласти
